app/controllers/complaints_controller.rb

SELECT "complaints".* FROM "complaints"
---
  def index
    @complaints = Complaint.all

INSERT INTO "complaints" ("date", "location", "department", "description", "created_at", "updated_at", "reporter_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @complaint = Complaint.new(complaint_params)
    @post.reporter = current_user

    respond_to do |format|
      if @complaint.save

SELECT  "complaints".* FROM "complaints" WHERE "complaints"."id" = ? LIMIT ?  [["id", 805814820], ["LIMIT", 1]]
---
    def set_complaint
      @complaint = Complaint.find(params[:id])