app/controllers/sessions_controller.rb

  def create
    # @provider_hash = request.env['omniauth.auth'].to_json
    omni = request.env['omniauth.auth']
    @reporter = Reporter.find_or_create_by(uid: omni['uid']) do |reporter|
---
SELECT  "reporters".* FROM "reporters" WHERE "reporters"."uid" = ? LIMIT ?  [["uid", "wxie11@hawk.iit.edu"], ["LIMIT", 1]]